simpleFoam/campagneUniformG0Rotation/H100S/D050L474W030G000H100V015_S/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "startBC/initialConditions"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient; 
    }
    top
    {
        type            symmetry;
    }
    //"(bottom|frontAndBack)"//|cylinder)"
    "(cylinder|frontAndBack)"
    {
        type            nutkWallFunction; 
	    value		    uniform 0;
    }
    bottom
    {
        type            nutkRoughWallFunction; 
	    value		    uniform 0;
        Ks              uniform 1.8e-3;
        Cs              uniform 1;
    }
}


// ************************************************************************* //
